emacs/config.org
* General UI settings
** Do not show startup screen
#+begin_src emacs-lisp

(setq inhibit-startup-message t)

#+end_src
** Disable tool bar, menu bar and scroll bar
#+begin_src emacs-lisp

(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
(tooltip-mode -1)
(set-fringe-mode 10)

#+end_src
** Line number configuration
#+begin_src emacs-lisp

;; Highlight current line
(global-hl-line-mode t)
;; Enable line numbers
(global-display-line-numbers-mode t)
;; Set relative line numbers
(setq display-line-numbers-type 'relative)

#+end_src
** Disable bell sound
#+begin_src emacs-lisp

(setq ring-bell-function 'ignore)

#+end_src
(setq command-line-default-directory "~/")
#+end_src
** Set default fill-column
#+begin_src emacs-lisp
(setq-default fill-column 79)
#+end_src

* Package management
** Add MELPA to package archives
#+begin_src emacs-lisp

(require 'package)
(setq package-archives
      '(("melpa" . "https://melpa.org/packages/")
        ("gnu" . "https://elpa.gnu.org/packages/")
        ("org" . "http://orgmode.org/elpa/")))
(package-initialize)

#+end_src
** Install use-package for easy package installation
#+begin_src emacs-lisp

(when (not (package-installed-p 'use-package))
  (package-refresh-contents)
  (package-install 'usepackage))

#+end_src
** Use Delight to hide modes from modeline bar
#+begin_src emacs-lisp

(use-package delight
  :ensure t)

#+end_src

* Themes
** General theme
Currently using doom-one from doom-themes
#+begin_src emacs-lisp

(use-package doom-themes
  :ensure t
  :init
  (setq doom-themes-enable-bold t
	doom-themes-enable-italic t)
  (load-theme 'doom-one t))

#+end_src
** Doom modeline 
This package depends on all-the-icons package. When installing Doom
modeline for the first time, please run 'all-the-icons-install-fonts'
via M-x first.
#+begin_src emacs-lisp

(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1))

#+end_src

Ensure icons are used in Daemon mode:

#+begin_src emacs-lisp

(add-hook 'server-after-make-frame-hook
 (lambda ()
     (setq doom-modeline-icon (display-graphic-p))))

#+end_src
* Emacs UI and menu enhancements
** Which key
Which key adds a guiding menu for keybindings
#+begin_src emacs-lisp
(use-package which-key
  :ensure t
  :delight
  :init
  (setq which-key-idle-delay 0.5)
  :config (which-key-mode))
#+end_src
** Ivy, Counsel and Swiper
Ivy is a customisable completion mechanism. Counsel contains a collection of
Ivy-enhanced versions of command Emacs commands (e.g. M-x). Swiper as an
Ivy-enhanced version of Isearch.
#+begin_src emacs-lisp
(use-package ivy
  :ensure t
  :diminish
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1))
(use-package counsel
  :ensure t
  :after ivy
  :config (counsel-mode))
(use-package swiper
  :ensure t
  :after ivy)
;; Ivy rich to add description to M-x and other menus
(use-package ivy-rich
  :ensure t
  :after ivy
  :custom
  (ivy-virtual-abbreviate 'full
			  ivy-rich-switch-buffer-align-virtual-buffer t
			  ivy-rich-path-style 'abbrev)
  :config
  (ivy-set-display-transformer 'ivy-switch-buffer
                               'ivy-rich-switch-buffer-transformer))
(ivy-rich-mode 1)
(setq ivy-initial-inputs-alist nil) ; Remove the ^ in ivy buffers
					; Smex to allow M-x remember our history
(use-package smex :ensure t)
(smex-initialize)
#+end_src
** Helpful
Helpful package for more helpful descriptions of functions, commands and
variables.
#+begin_src emacs-lisp
(use-package helpful
  :ensure t
  :commands (helpful-callable helpful-variable helpful-command helpful-key)
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))
#+end_src

* Project management

** TODO Magit

#+begin_src emacs-lisp
(use-package magit
  :ensure t
  :bind ("C-x g" . magit-status))
#+end_src

** Projectile

#+begin_src emacs-lisp
(use-package projectile
  :ensure t
  :delight projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  ;; NOTE: Set this to the folder where you keep your Git repos!
  (when (file-directory-p "~/PythonProjects")
    (setq projectile-project-search-path '("~/PythonProjects")))
  (setq projectile-switch-project-action #'projectile-dired))

(use-package counsel-projectile
  :ensure t
  :after projectile)
#+end_src

* Other useful packages
** Hydra
#+begin_src emacs-lisp
(use-package hydra
  :ensure t)
#+end_src
** Command log mode to show keypress and command
Related commands start with "clm" in the M-x menu
#+begin_src emacs-lisp
(use-package command-log-mode
  :ensure t)
#+end_src
** Yasnippet

#+begin_src emacs-lisp
(use-package yasnippet
  :ensure t
  :init
  (yas-global-mode 1))
#+end_src

* Window management
** Winum
#+begin_src emacs-lisp
(use-package winum
  :ensure t
  :config (progn
	    (setq winum-scope 'frame-local
		  winum-reverse-frame-list nil
		  winum-auto-setup-setup-mode-line nil
		  winum-ignored-buffers '(" *which-key*"))
	    (winum-mode)))
#+end_src
** Function to interactivel resize window
#+begin_src emacs-lisp
(defhydra hydra-window-resize ()
  "Resize window"
  ("h" shrink-window-horizontally "shrink horizontally")
  ("l" enlarge-window-horizontally "enlarge horizontally")
  ("j" shrink-window "shrink vertically")
  ("k" enlarge-window "enlarge vertically")
  ("b" balance-windows "reset sizes")
  ("q" nil "quit"))
#+end_src

* File management

** Dired

#+begin_src emacs-lisp

(use-package dired
  :after evil evil-collection
  ;; :commands (dired dired-jump)
  ;; :bind (("C-x C-j" . dired-jump))
  :custom ((dired-listing-switches "-agho --group-directories-first"))
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "h" 'dired-single-up-directory
    "l" 'dired-single-buffer))

(use-package dired-single
  :ensure t)

(use-package all-the-icons-dired
  :ensure t
  :hook (dired-mode . all-the-icons-dired-mode))

(use-package dired-hide-dotfiles
  :ensure t
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "H" 'dired-hide-dotfiles-mode))

#+end_src

*** Mac specific settings

OS X's ls function does not support the --group-directories-first switch. In order to enable this, install GNU core utils:

#+begin_src shell

brew install coreutils

#+end_src

Then the emacs-lisp code below ensures that dired uses the gls (GNU ls) command:

#+begin_src emacs-lisp

(when (string= system-type "darwin")
  (setq dired-use-ls-dired t
        insert-directory-program "/usr/local/bin/gls"))

#+end_src
* Keybindings
** Evil mode
The Evil package(s) enable Vim-like keybindings
#+begin_src emacs-lisp
(use-package evil
  :ensure t
  :init      ;; tweak evil's configuration before loading it
  (setq evil-want-integration t) ;; This is optional since it's already set to t by default.
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-vsplit-window-right t)
  (setq evil-split-window-below t)
  :config
  (evil-mode)
  ;; Use visual line motions (e.g. for when a long line is wrapped)
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line))
#+end_src

Evil collection is a collection of Evil bindings for the parts of Emacs that Evil does not cover properly by default.

#+begin_src emacs-lisp
(use-package evil-collection
  :ensure t
  :after evil
  :config
  (setq evil-collection-mode-list '(dashboard dired ibuffer magit pdf doc-view company)) ; Modes to activate Evil keybindings for
  (evil-collection-init))
#+end_src

Bind jk in insert mode to ESC.

#+begin_src emacs-lisp
(use-package key-chord
  :ensure t
  :init
  (setq key-chord-two-keys-delay 0.5)
  (key-chord-define evil-insert-state-map "jk" 'evil-normal-state)
  (key-chord-mode 1))
#+end_src

Evil nerd commenter for line comment

#+begin_src emacs-lisp
(use-package evil-nerd-commenter
  :ensure t)
#+end_src
** Undo tree
Enable Vim-like undo/redo
#+begin_src emacs-lisp
(use-package undo-tree
  :ensure t
  :init
  (global-undo-tree-mode)
  (evil-set-undo-system 'undo-tree))
#+end_src

** Bindings with SPC prefix
The config in this section enable SPC as a prefix to a useful and commonly used
function (similar to Spacemacs/Doom/VSpaceCode).

*** General package 
#+begin_src emacs-lisp
(use-package general
  :ensure t
  :init
  (setq general-override-states '(insert
                                  emacs
                                  hybrid
                                  normal
                                  visual
                                  motion
                                  operator
                                  replace))
  :after evil
  :config
  (general-evil-setup t)
  (general-create-definer leader-keys
    :states '(normal visual emacs motion) ; consider adding motion for using with easymotion
    :keymaps 'override 
    :prefix "SPC"))
#+end_src

