emacs/config.org
*** Buffer management
Add function to kill all buffers except current one.
#+begin_src emacs-lisp
(defun kill-other-buffers ()
  "Kill all other buffers."
  (interactive)
  (mapc 'kill-buffer (delq (current-buffer) (buffer-list))))
#+end_src

Keybindings for buffer management.
#+begin_src emacs-lisp
(leader-keys
  "TAB"   '(counsel-switch-buffer :which-key "Switch buffer")
  "b"     '(:ignore t :which-key "Buffer")
  "b b"   '(ibuffer :which-key "Ibuffer")
  "b c"   '(clone-indirect-buffer-other-window :which-key "Clone indirect buffer other window")
  "b k"   '(kill-current-buffer :which-key "Kill current buffer")
  "b n"   '(next-buffer :which-key "Next buffer")
  "b p"   '(previous-buffer :which-key "Previous buffer")
  "b B"   '(ibuffer-list-buffers :which-key "Ibuffer list buffers")
  "b K"   '(kill-buffer :which-key "Kill buffer")
  "b 1"   '(kill-other-buffers :which-key "Kill other buffers"))
#+end_src
*** File management
#+begin_src emacs-lisp
(leader-keys
  "f"     '(:ignore t :which-key "File")
  "."     '(find-file :which-key "Find file")
  "f f"   '(find-file :which-key "Find file")
  "f r"   '(counsel-recentf :which-key "Recent files")
  "f s"   '(save-buffer :which-key "Save file")
  "f u"   '(sudo-edit-find-file :which-key "Sudo find file")
  "f y"   '(dt/show-and-copy-buffer-path :which-key "Yank file path")
  "f C"   '(copy-file :which-key "Copy file")
  "f D"   '(delete-file :which-key "Delete file")
  "f R"   '(rename-file :which-key "Rename file")
  "f S"   '(write-file :which-key "Save file as...")
  ;; "f d"   '(:ignore t :which-key "Dired")
  "d"     '(dired :which-key "Dired")
  ;; "f d d" '(dired :which-key "Dired")
  "f j"   '(dired-jump :which-key "Dired jump")
  ;; "f d j" '(dired-jump :which-key "Dired jump")
  "f U"   '(sudo-edit :which-key "Sudo edit file"))
#+end_src
*** Window management
#+begin_src emacs-lisp
(winner-mode 1)
(leader-keys
  ;; Window splits
  "w"     '(:ignore t :which-key "Window")
  "w c"   '(evil-window-delete :which-key "Close window")
  "w n"   '(evil-window-new :which-key "New window")
  "w s"   '(evil-window-split :which-key "Horizontal split window")
  "w v"   '(evil-window-vsplit :which-key "Vertical split window")
  "w C"   '(delete-other-windows :which-key "Close other windows")
  "w r"   '(hydra-window-resize/body :which-key "Resize window")
  ;; Window motions
  "w h"   '(evil-window-left :which-key "Window left")
  "w j"   '(evil-window-down :which-key "Window down")
  "w k"   '(evil-window-up :which-key "Window up")
  "w l"   '(evil-window-right :which-key "Window right")
  "w w"   '(evil-window-next :which-key "Goto next window")
  ;; winner mode
  "w <left>"  '(winner-undo :which-key "Winner undo")
  "w <right>" '(winner-redo :which-key "Winner redo")
  ;; Window numbers
  "1" '(winum-select-window-1 :which-key "Select window 1")
  "2" '(winum-select-window-2 :which-key "Select window 2")
  "3" '(winum-select-window-3 :which-key t)
  "4" '(winum-select-window-4 :which-key t)
  "5" '(winum-select-window-5 :which-key t)
  "6" '(winum-select-window-6 :which-key t)
  "7" '(winum-select-window-7 :which-key t)
  "8" '(winum-select-window-8 :which-key t))
#+end_src
*** Git
#+begin_src emacs-lisp
(leader-keys
  "g"   '(:ignore t :which-key "Git")
  "g s" '(magit :which-key "Magit status"))
#+end_src
*** General text bindings
#+begin_src emacs-lisp
(leader-keys
  "x"   '(:ignore t :which-key "Text")
  "x i" '(indent-region :which-key "Indent region")
  "x s" '(flyspell-correct-wrapper :which-key "Flyspell correct")
  ";"   '(evilnc-comment-or-uncomment-lines :which-key "Toggle line comment"))
#+end_src
*** Easymotion

#+begin_src emacs-lisp

(use-package evil-easymotion
  :ensure t
  :after (general evil)
  :general
  (leader-keys
    "j"   '(:ignore t :which-key "Jump to")
    "j f" '(evilem-motion-find-char :which-key "Find char")
    "j F" '(evilem-motion-find-char-backward :which-key "Find char backward")
    "j j" '(evilem-motion-find-char :which-key "Find char")
    "j J" '(evilem-motion-find-char-backward :which-key "Find char backward")
    "j t" '(evilem-motion-find-char-to :which-key "To char")
    "j T" '(evilem-motion-find-char-to-backward :which-key "To char backward")
    "j l" '(evilem-motion-next-line :which-key "Jump to line forward")
    "j L" '(evilem-motion-previous-line :which-key "Jump to line backward")
    "j e" '(evilem-motion-forward-word-end :which-key "Forward word end")
    "j E" '(evilem-motion-forward-WORD-end :which-key "Forward WORD end")
    "j g e" '(evilem-motion-backward-word-end :which-key "Backward word end")
    "j g E" '(evilem-motion-backward-WORD-end :which-key "Backward WORD end")
    "j w" '(evilem-motion-forward-word-begin :which-key "Forward word")
    "j W" '(evilem-motion-forward-WORD-begin :which-key "Forward WORD")
    "j b" '(evilem-motion-backward-word-begin :which-key "Backward word")
    "j B" '(evilem-motion-backward-WORD-begin :which-key "Backward WORD")
    "j n" '(evilem-motion-search-next :which-key "Search next")
    "j N" '(evilem-motion-search-previous :which-key "Search previous")
    "j g" '(:ignore t :which-key "Backward word end")))

#+end_src

*** evil-snipe

evil-snipe is simulates Vim sneak.

#+begin_src emacs-lisp

(use-package evil-snipe
  :ensure t
  :init
  (evil-normalize-keymaps)
  :after evil
  ;; :general
  ;; (general-vmap evil-snipe-local-mode-map "z" 'evil-snipe-s)
  ;; (general-vmap 'visual evil-snipe-local-mode-map "Z" 'evil-snipe-S)
  :hook (magit-mode . turn-off-evil-snipe-override-mode)
  :custom
  (evil-snipe-scope 'visible)
  (evil-snipe-repeat-scope 'whole-visible)
  (evil-snipe-spillover-scope 'whole-buffer))

  (evil-snipe-mode +1)
  (evil-snipe-override-mode +1)

#+end_src

*** evil-surround

#+begin_src emacs-lisp
(use-package evil-surround
  :ensure t
  :config
  (global-evil-surround-mode 1))
#+end_src

*** Eval
#+begin_src emacs-lisp
(leader-keys
  "e"     '(:ignore t :which-key "Eval")
  "e b"   '(eval-buffer :which-key "Eval elisp in buffer")
  "e d"   '(eval-defun :which-key "Eval defun")
  "e e"   '(eval-expression :which-key "Eval elisp expression")
  "e l"   '(eval-last-sexp :which-key "Eval last sexression")
  "e r"   '(eval-region :which-key "Eval region"))
#+end_src
*** Shells and terminals
#+begin_src emacs-lisp
(leader-keys
  "'" '(sh :which-key "Start zsh"))
#+end_src
* Shells and terminals
** Function to disable exit confirmation query for shells and terminals
#+begin_src emacs-lisp
(defun set-no-process-query-on-exit ()
  (let ((proc (get-buffer-process (current-buffer))))
    (when (processp proc)
      (set-process-query-on-exit-flag proc nil))))
#+end_src
** Settings for shell-mode-hook and term-mode-hook
Disable line numbers, line highlight and exit confirmation
#+begin_src emacs-lisp
(dolist (mode '(term-mode-hook
		shell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0)))
  (add-hook mode (lambda () (setq-local global-hl-line-mode nil)))
  (add-hook mode 'set-no-process-query-on-exit))
#+end_src
* Org mode
#+begin_src emacs-lisp
(add-hook 'org-mode-hook 'org-indent-mode)
(setq ;org-directory "~/Org/"
 org-agenda-files '("~/org/tasks.org"
                    "~/org/birthdays.org")
 ;; Settings for todo states
 org-todo-keywords
   '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)"))
 ;; Settings for log mode for finished tasks
 org-agenda-start-with-log-mode t
 org-log-done 'time
 org-log-into-drawer t
					;org-default-notes-file (expand-file-name "notes.org" org-directory)
 org-ellipsis " ▼ "
 org-log-done 'time
					;org-journal-dir "~/Org/journal/"
 org-journal-date-format "%B %d, %Y (%A) "
 org-journal-file-format "%Y-%m-%d.org"
 org-hide-emphasis-markers t
 org-startup-indented t)

(setq org-src-preserve-indentation t
      org-src-fontify-natively t
      org-src-tab-acts-natively t
      org-edit-src-content-indentation 0)
(use-package org-bullets
  :ensure t)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))

(use-package org-tempo)
(with-eval-after-load 'org
  ;; This is needed as of Org 9.2
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python")))
#+end_src
* Markdown

#+begin_src emacs-lisp

(use-package markdown-mode
  :ensure t
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :init (setq markdown-command "multimarkdown"))

#+end_src

* Development

** Language Server Protocol (lsp-mode)

#+begin_src emacs-lisp
(defun lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

(use-package lsp-mode
  :ensure t
  :commands (lsp lsp-deferred)
  :hook (lsp-mode . lsp-mode-setup)
  :init
  (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
  :config
  (lsp-enable-which-key-integration t))

(use-package lsp-ui
  :ensure t
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-doc-position 'bottom))

(use-package lsp-treemacs
  :ensure t
  :after lsp)

(use-package lsp-ivy
  :ensure t
  :after lsp)
#+end_src

The following lines are required to tune and improve LSP performance (see also [[https://emacs-lsp.github.io/lsp-mode/page/performance/][here]]):

#+begin_src emacs-lisp

(setq gc-cons-threshold 100000000)
(setq read-process-output-max (* 1024 1024)) ;; 1mb
(setq lsp-idle-delay 0.500)

#+end_src

