emacs/config.org
** Debugging with dap

#+begin_src emacs-lisp
(use-package dap-mode
  :ensure t
  ;; Uncomment the config below if you want all UI panes to be hidden by default!
  ;; :custom
  ;; (lsp-enable-dap-auto-configure nil)
  ;; :config
  ;; (dap-ui-mode 1)
  :commands dap-debug
  :config
  ;; Set up Node debugging
  (require 'dap-node)
  (dap-node-setup) ;; Automatically installs Node debug adapter if needed

  ;; Bind `C-c l d` to `dap-hydra` for easy access
  (general-define-key
   :keymaps 'lsp-mode-map
   :prefix lsp-keymap-prefix
   "d" '(dap-hydra t :wk "debugger")))
#+end_src

** Company for completion

#+begin_src emacs-lisp
(use-package company
  :ensure t
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :bind (:map company-active-map
              ("<tab>" . company-complete-selection))
  (:map lsp-mode-map
        ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))

(use-package company-box
  :ensure t
  :hook (company-mode . company-box-mode))
#+end_src

** Python

*** Basic setup

#+begin_src emacs-lisp

(use-package python-mode
  :ensure t
  :hook
  (python-mode . (lambda ()
		   (lsp-deferred)))
  :custom
  ;; NOTE: Set these if Python 3 is called "python3" on your system!
  ;; (python-shell-interpreter "python3")
  ;; (dap-python-executable "python3")
  (dap-python-debugger 'debugpy)
  :config
  (require 'dap-python))

(use-package conda
  :ensure t
  :defer t
  :init
  (setq conda-anaconda-home (expand-file-name "~/miniconda3"))
  (setq conda-env-home-directory (expand-file-name "~/miniconda3"))
  :config
  (conda-env-initialize-interactive-shells)
  (conda-env-initialize-eshell))

#+end_src

**** Troubleshooting

The first Python buffer always starts in "Py mode" instead of "Python
mode". All subsequent buffers are correctly opened in "Python
mode". Different posts on the internet suggest to add the following
lines, however this did not help for me. For completeness though,
these are the lines:

#+begin_src emacs-lisp

;; (autoload 'python-mode "python-mode" "Python Mode." t)
;; (add-to-list 'auto-mode-alist '("\\.py\\'" . python-mode))
;; (add-to-list 'interpreter-mode-alist '("python" . python-mode))

#+end_src

*** Linting and formatting

flake8 for linting and black(en) for formatting. Also enables auto-formatting
on save for Python mode.

#+begin_src emacs-lisp

(use-package flycheck
  :ensure t
  :hook
  (python-mode . (lambda () (flycheck-add-next-checker 'lsp 'python-flake8)))
  :config
  (setq flycheck-python-flake8-executable "flake8")) ; Ensure flake8 is in path

(use-package blacken
  :ensure t
  :hook
  (python-mode . (lambda () (add-hook 'before-save-hook 'blacken-buffer))))

#+end_src


*** Pyright (Python lsp)

Before using lsp-pyright, make sure sure you have installed node.js through your package manager (the npm command should be available in your terminal). Then, install pyright globally by running the following command in your terminal:

#+begin_src bash

npm install -g pyright

sudo npm update -g pyright

#+end_src

#+begin_src emacs-lisp

(use-package lsp-pyright
  :ensure t
  :hook (python-mode . (lambda ()
                         (require 'lsp-pyright)
                         (lsp-deferred)
			 (flycheck-add-next-checker 'lsp 'python-flake8)))
  :config
  (add-hook 'pyvenv-post-activate-hooks (lambda () (lsp-restart-workspace)))
  (add-hook 'conda-postactivate-hook (lambda () (lsp-restart-workspace)))
  (add-hook 'conda-postdeactivate-hook (lambda () (lsp-restart-workspace)))) ; or lsp-deferred

#+end_src

*** Python MS LSP

This is an alternative solution to Pyright. Currently using Pyright on work desktop as it seems to be stable and fairly quick (after tuning the options).

# #+begin_src emacs-lisp
# (use-package lsp-python-ms
#   :ensure t
#   :init (setq lsp-python-ms-auto-install-server t)
#   :hook (python-mode . (lambda ()
#                           (require 'lsp-python-ms)
#                           (lsp-deferred)))  ; or lsp-deferred
#   :config
#   (add-hook 'pyvenv-post-activate-hooks (lambda () (lsp-restart-workspace)))
#   (add-hook 'conda-postactivate-hook (lambda () (lsp-restart-workspace)))
#   (add-hook 'conda-postdeactivate-hook (lambda () (lsp-restart-workspace)))) ; or lsp-deferred
# #+end_src

* Spell check

Spell checking is done with flyspell and aspell. Aspell needs to be installed
on OS level. Paths below need to be updated accordingly.

Run M-x flyspell-buffer to do a spell check on the whole buffer. Alternatively,
this can also be added as a hook.

#+begin_src emacs-lisp

(defun aspell-path ()
  (cond ((eq system-type 'gnu/linux) "/usr/bin/aspell")
	((eq system-type 'darwin) "/usr/local/bin/aspell")
	(t "/usr/bin/aspell")))

(use-package flyspell
  :custom
  (ispell-program-name "aspell")
  ;; Default dictionary. To change do M-x ispell-change-dictionary RET.
  (aspell-dictionary "en_GB-ise-wo_accents")
  ;; (aspell-program-name "/usr/local/bin/aspell")
  (aspell-program-name (aspell-path))
  (ispell-dictionary "en_GB-ise-wo_accents")
  ;; (ispell-program-name "/usr/local/bin/aspell")
  (ispell-program-name (aspell-path))
  :config
  (add-hook 'markdown-mode-hook 'flyspell-mode))

(use-package flyspell-correct
  :ensure t
  :bind ("C-;" . flyspell-correct-wrapper))

#+end_src

* PDF tools

Also install pdftotext in your OS (e.g. via sudo apt on Ubuntu).

#+begin_src emacs-lisp

(use-package pdf-tools
  :ensure t)
#+end_src

